[
  {
    "company": "Eyas Gaming",
    "date": "Jan 2023 - Present",
    "position": "Senior Software Engineer",
    "link": "https://eyasgaming.com/",
    "descriptions": [
      "Actively contributed to the development and maintenance of two major projects: an interactive online casino platform and a dynamic football online betting platform. Utilized modern web development frameworks and libraries such as React and Redux to build responsive and user-friendly interfaces, ensuring optimal user experience.",
      "Collaborated with a team of developers using Microsoft Azure for source control, ensuring smooth version control and code integration. Regularly participated in agile development cycles, using Jira for task tracking, sprint planning, and bug tracking. Collaborated closely with cross-functional teams, including designers, backend developers, and product managers, to deliver high-quality features on time.",
      "In our project, we utilize AEM to oversee multiple casino brands. Through AEM, we not only configure site settings for each brand and page but also manage templates, components, and workflows to ensure consistent content delivery. The Digital Asset Management (DAM) system in AEM helps us centralize and manage media assets effectively. We also make use of AEM&apos;s personalization features to tailor user experiences based on audience segments. With the integration of the CRX manager, I ensure seamless data synchronization between the development and production environments, ensuring a smooth content deployment process."
    ]
  },
  {
    "company": "Anvilo",
    "date": "Mar 2020 - Jan 2023",
    "position": "Software Developer",
    "link": "https://anvilo.com/",
    "descriptions": [
      "Developing a virtual phone system application for one of the company&apos;s clients, which serves hundred thousands of users.",
      "Creating features for making, receiving phone and video calls, text messaging and call history for desktop, browser or mobile phone device.",
      "Working closely with the product management team to ensure we&apos;re building the best products for our client.",
      "Reviewing code for quality, finding weaknesses & ensuring adherence to standards.",
      "Debugging and optimizing code and automate routine tasks.",
      "Using the ability to think from a user perspective."
    ]
  },
  {
    "company": "Mentor Mate",
    "date": "Feb 2018 - Mar 2020",
    "position": "Software Developer",
    "link": "https://mentormate.com/",
    "descriptions": [
      "Contributed to the team goals and worked on tasks covering the entire code base development lifecycle.",
      "Developed new and supporting existing features.",
      "Implemented creative solutions for web platforms used by thousands of customers.",
      "Develop fully responsive web pages for company&apos;s clients.",
      "Constantly improve quality of the codebase."
    ]
  }
]
